zengwangfa/Smart-Hive/new_node/bsp/stm32/stm32f405-smdz-breadfruit/board/board.h
/*
 * Copyright (c) 2006-2018, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2018-11-5      SummerGift   first version
 */

#ifndef __BOARD_H__
#define __BOARD_H__

#include <rtthread.h>
#include <stm32f4xx.h>
#include "drv_common.h"
#include "drv_gpio.h"

#ifdef __cplusplus
extern "C" {
#endif

/* Flash 默认分区表 */
#define RT_PARTITION_DEFAULT_TABLE               \
{                                                \
    {                                            \
        /* EasyFlash Backup Section */           \
        .name       = "ef_bak",                  \
        .offset     = 0,                         \
        .size       = 2 * 1024 * 1024,           \
        .flags = PARTITION_WRITEABLE,            \
    }, {                                         \
        /* Fatfs*/                               \
        .name       = "fatfs",                   \
        .offset     = 2 * 1024 * 1024,           \
        .size       = 14 * 1024 * 1024,          \
        .flags = PARTITION_WRITEABLE,            \
    }                                            \
}
#define STM32_FLASH_START_ADRESS     ((uint32_t)0x08000000)
#define STM32_FLASH_SIZE             (1024 * 1024)
#define STM32_FLASH_END_ADDRESS      ((uint32_t)(STM32_FLASH_START_ADRESS + STM32_FLASH_SIZE))

#define STM32_SRAM_SIZE           (128)
#define STM32_SRAM_END            (0x20000000 + STM32_SRAM_SIZE * 1024)

#if defined(__CC_ARM) || defined(__CLANG_ARM)
extern int Image$$RW_IRAM1$$ZI$$Limit;
#define HEAP_BEGIN      (&Image$$RW_IRAM1$$ZI$$Limit)
#elif __ICCARM__
#pragma section="CSTACK"
#define HEAP_BEGIN      (__segment_end("CSTACK"))
#else
extern int __bss_end;
#define HEAP_BEGIN      (&__bss_end)
#endif

#define HEAP_END        STM32_SRAM_END

void SystemClock_Config(void);

#ifdef __cplusplus
}
#endif

#endif

